Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: audio/locales/*.po
Languages: vi_vn

source: Scope must be a valid version of one of the following: ​ ​ ​ ​ Global ​ ​ ​ ​ Guild ​ ​ ​ ​ User
vi_vn: Phạm vi phải là phiên bản hợp lệ của một trong những điều sau: ​ ​ ​ ​ Toàn cầu ​ ​ ​ ​ Guild ​ ​ ​ ​ Người dùng

source: Author must be a valid version of one of the following: ​ ​ ​ ​ User ID ​ ​ ​ ​ User Mention ​ ​ ​ ​ User Name#123
vi_vn: Tác giả phải là phiên bản hợp lệ của một trong những điều sau: ​ ​ ​ ​ ID người dùng ​ ​ ​ ​ Đề cập của Người dùng ​ ​ ​ ​ Tên người dùng#123

source: Guild must be a valid version of one of the following: ​ ​ ​ ​ Guild ID ​ ​ ​ ​ Exact guild name
vi_vn: Hội phải là phiên bản hợp lệ của một trong những điều sau: ​ ​ ​ ​ ID Hội ​ ​ ​ ​ Tên hội chính xác

source: "{arg}" was not found. It must be the ID or complete name of a server which the bot can see.
vi_vn: "{arg}" không được tìm thấy. Nó phải là ID hoặc tên đầy đủ của máy chủ mà bot có thể nhìn thấy.

source: "{arg}" does not refer to a unique server. Please use the ID for the server you're trying to specify.
vi_vn: "{arg}" không tham chiếu đến một máy chủ duy nhất. Vui lòng sử dụng ID cho máy chủ mà bạn đang cố gắng chỉ định.

source: "{arg}" was not found. It must be the ID or name or mention a user which the bot can see.
vi_vn: "{arg}" không tìm thấy. Nó phải là ID hoặc tên hoặc đề cập đến người dùng mà bot có thể nhìn thấy.

source: Could not match '{}' to a playlist.
vi_vn: Không thể ghép '{}' với một danh sách phát.

source: Nothing
vi_vn: Không có gì

source: You cannot use `--guild`
vi_vn: Bạn không thể dùng `--guild`

source: You cannot use `--to-server`
vi_vn: Bạn không thể dùng `--to-server`

source: You cannot use `--from-server`
vi_vn: Bạn không thể dùng `--from-server`
