Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: shutup/locales/*.po
Languages: hr_hr, id_id

source: Bank
hr_hr: Banka

source: Base command for bank settings.
hr_hr: Osnovna naredba za postavke banke.
id_id: Command dasar untuk pengaturan bank.

source: Show the current bank settings.
hr_hr: Prikaži trenutne postavke banke.
id_id: Lihat pengaturan bank.

source: Global
hr_hr: Globalno

source: Bank settings: Bank name: {bank_name} Bank scope: {bank_scope} Currency: {currency_name} Default balance: {default_balance} Maximum allowed balance: {maximum_bal}
hr_hr: Postavke banke: Naziv banke: {bank_name} Opseg banke: {bank_scope} Valuta: {currency_name} Zadani ukupni iznos: {default_balance} Maksimani dopušten ukupni iznos: {maximum_bal}
id_id: Pengaturan Bank: Nama Bank: {bank_name} Cakupan Bank: {bank_scope} Mata Uang: {currency_name} Saldo Awal: {default_balance} Saldo Maksimum: {maximum_bal}

source: Toggle whether the bank is global or not. If the bank is global, it will become per-server. If the bank is per-server, it will become global.
hr_hr: Prebacite je li banka globalna ili ne Ako je banka globalna, postat će povezana sa serverom. Ako je banka povezana sa serverom, postat će globalna.
id_id: Mengalihkan apakah bank global atau tidak. Jika bank global, akan menjadi per-server. Jika bank per-server, akan menjadi global.

source: per-server
hr_hr: povezana sa serverom

source: global
hr_hr: globalna

source: This will toggle the bank to be {banktype}, deleting all accounts in the process! If you're sure, type `{command}`
hr_hr: Ovime će banka postati {banktype}, brišući sve račune u tom procesu! Ako ste sigurni, upišite `{command}`
id_id: Ini akan membuat bank menjadi {banktype}, yang akan menghapus semua akun dalam prosesnya! Jika anda yakin, ketik `{command}`

source: The bank is now {banktype}.
hr_hr: Banka je sada {banktype}.
id_id: Bank telah menjadi {banktype}.

source: Set the bank's name.
hr_hr: Postavite naziv banke.
id_id: Tentukan nama bank.

source: Bank name has been set to: {name}
hr_hr: Naziv banke postavljen je kao: {name}
id_id: Nama bank telah ditetapkan menjadi: {name}

source: Set the name for the bank's currency.
hr_hr: Postavite naziv za valutu banke.
id_id: Tentukan nama untuk saldo bank.

source: Currency name has been set to: {name}
hr_hr: Naziv valute postavljen je kao: {name}
id_id: Nama mata uang telah ditetapkan menjadi: {name}

source: Set the maximum balance a user can get.
hr_hr: Postavite maksimalni ukupni iznos koji korisnik može dobiti.
id_id: Tentukan saldo maksimum yang bisa didapatkan seseorang.

source: Amount must be greater than zero and less than {max}.
hr_hr: Iznos mora biti veći od nule i manji od {max}.
id_id: Jumlah harus lebih dari nol dan kurang dari {max}.

source: Maximum balance has been set to: {amount}
hr_hr: Maksimalni ukupni iznos postavljen je na: {amount}
id_id: Saldo maksimum telah ditetapkan menjadi: {amount}
