Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: admin/locales/*.po
Languages: ca_es, sv_se

source: I attempted to do something that Discord denied me permissions for. Your command failed to successfully complete.
ca_es: He intentat fer una cosa per la qual Discord m'ha denegat els permisos. La vostra comanda no s'ha pogut completar correctament.
sv_se: Jag försökte göra något som Discord nekade mig behörighet till. Ditt kommando kunde inte slutföras.

source: I can not give {role.name} to {member.display_name} because that role is higher than or equal to my highest role in the Discord hierarchy.
ca_es: No puc donar {role.name} a {member.display_name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte ge {role.name} till {member.display_name} eftersom den rollen är högre än eller lika med min högsta roll i Discord-hierarkin.

source: I can not remove {role.name} from {member.display_name} because that role is higher than or equal to my highest role in the Discord hierarchy.
ca_es: No puc treure {role.name} a {member.display_name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte ta bort {role.name} från {member.display_name} eftersom den rollen är högre än eller lika med min högsta roll i Discord-hierarkin.

source: I can not edit {role.name} because that role is higher than my or equal to highest role in the Discord hierarchy.
ca_es: No puc editar {role.name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte redigera {role.name} eftersom den rollen är högre än min eller lika med högsta roll i Discord-hierarkin.

source: I can not let you give {role.name} to {member.display_name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ca_es: No puc deixar-te donar {role.name} a {member.display_name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte låta dig ge {role.name} till {member.display_name} eftersom den rollen är högre än eller lika med din högsta roll i Discord-hierarkin.

source: I can not let you remove {role.name} from {member.display_name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ca_es: No puc deixar-te treure {role.name} a {member.display_name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte låta dig ta bort {role.name} från {member.display_name} eftersom den rollen är högre än eller lika med din högsta roll i Discord-hierarkin.

source: I can not let you edit {role.name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ca_es: No puc deixar-te editar {role.name} perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte låta dig redigera {role.name} eftersom den rollen är högre än eller lika med din högsta roll i Discord-hierarkin.

source: I need the "Manage Roles" permission to do that.
sv_se: Jag behöver behörigheten "Hantera roller" för att göra det.

source: I am already announcing something. If you would like to make a different announcement please use `{prefix}announce cancel` first.
ca_es: Ja estic anunciant alguna cosa. Si voleu fer un anunci diferent, primer utilitzeu `{prefix}announce cancel`.
sv_se: Jag tillkännager redan något. Om du vill göra ett annat tillkännagivande, vänligen använd `{prefix}announce cancel` först.

source: A collection of server administration utilities.
ca_es: Una col·lecció d’utilitats d’administració de servidors.
sv_se: En samling administrationsverktyg för servern.

source: {member.display_name} already has the role {role.name}.
ca_es: {member.display_name} ja té el rol {role.name}.
sv_se: {member.display_name} har redan rollen {role.name}.

source: I successfully added {role.name} to {member.display_name}
ca_es: He afegit amb èxit {role.name} a {member.display_name}
sv_se: Jag lyckades lägga till {role.name} till {member.display_name}

source: {member.display_name} does not have the role {role.name}.
ca_es: {member.display_name} no té el rol {role.name}.
sv_se: {member.display_name} har inte rollen {role.name}.

source: I successfully removed {role.name} from {member.display_name}
ca_es: He tret amb èxit {role.name} a {member.display_name}
sv_se: Jag lyckades ta bort {role.name} från {member.display_name}

source: Add a role to a user. Use double quotes if the role contains spaces. If user is left blank it defaults to the author of the command.
ca_es: Afegir un rol a un usuari. Fer servir cometes si el rol té espais. Si l'usuari es deixa en blanc el valor per defecte és l'autor del comandament.
sv_se: Lägg till en roll till en användare. Använd dubbla citat om rollen innehåller mellanslag. Om användaren lämnas tom används som standard skaparen av kommandot.

source: Remove a role from a user. Use double quotes if the role contains spaces. If user is left blank it defaults to the author of the command.
ca_es: Treu un rol d'un usuari. Fer servir cometes si el rol té espais. Si l'usuari es deixa en blanc el valor per defecte és l'autor del comandament.
sv_se: Ta bort en roll från en användare. Använd dubbla citat om rollen innehåller mellanslag. Om användaren lämnas tom är det standard för skaparen av kommandot.

source: Edit role settings.
ca_es: Editar la configuració del rol.
sv_se: Redigera rollinställningar.

source: Edit a role's colour. Use double quotes if the role contains spaces. Colour must be in hexadecimal format. [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp) Examples: `[p]editrole colour "The Transistor" #ff0000` `[p]editrole colour Test #ff9900`
ca_es: Editar el color d'un rol. Fes servir cometes dobles si el rol té espais. El color ha d'estar en format hexadecimal. [Selector de color en línia](http://www.w3schools.com/colors/colors_picker.asp) Exemples: `[p]editrole colour "The Transistor" #ff0000` `[p]editrole colour Test #ff9900`
sv_se: Redigera en rolls färg. Använd dubbla citat om rollen innehåller mellanslag. Färgen måste vara i hexadecimalt format. [Online färgväljare] (http://www.w3schools. om/colors/colors_picker. sp) Exempel: `[p]editrole colour "The Transistor" #ff0000` `[p]editrole colour Test #ff9900`

source: Done.
ca_es: Fet.
sv_se: Klart.

source: Edit a role's name. Use double quotes if the role or the name contain spaces. Example: `[p]editrole name "The Transistor" Test`
ca_es: Editar el nom d'un rol. Fes servir cometes dobles si el rol o el nom té espais. Exemple: `[p]editrole name "The Transistor" Test`
sv_se: Redigera en rolls namn. Använd dubbla citat om rollen eller namnet innehåller mellanslag. Exempel: `[p]editrole name "The Transistor" Test`

source: Announce a message to all servers the bot is in.
ca_es: Anunciar un missatge a tots els servidors en què es troba el bot.
sv_se: Meddela ett meddelande till alla servrar som botten är i.

source: The announcement has begun.
ca_es: L’anunci ha començat.
sv_se: Tillkännagivandet har börjat.

source: Cancel a running announce.
ca_es: Cancel·lar un anunci en curs.
sv_se: Avbryt en löpande avisering.

source: There is no currently running announcement.
ca_es: Actualment no hi ha cap anunci en curs.
sv_se: Det finns inget aktivt meddelande för närvarande.

source: The current announcement has been cancelled.
ca_es: L'anunci actual s'ha cancel·lat.
sv_se: Det aktuella meddelandet har avbrutits.

source: Change how announcements are sent in this guild.
ca_es: Canvia com s’envien els anuncis en aquest servidor.
sv_se: Ändra hur meddelanden skickas i detta gille.

source: The announcement channel has been set to {channel.mention}
ca_es: El canal d'anuncis s'ha establert a {channel.mention}
sv_se: Tillkännagivandekanalen har satts till {channel.mention}

source: Unsets the channel for announcements.
ca_es: Treu el canal per als anuncis.
sv_se: Inaktiverar kanalen för meddelanden.

source: Add or remove a selfrole from yourself. Server admins must have configured the role as user settable. NOTE: The role is case sensitive!
ca_es: Afegeix o treu un rol a tu mateix. Els administradors del servidor han d'haver configurat la funció com a configurable per l'usuari. NOTA: El rol és sensible a majúscules!
sv_se: Lägg till eller ta bort en självroll från dig själv. Serveradministratörer måste ha konfigurerat rollen som användarinställbar. OBS: Rollen är skiftlägeskänslig!

source: Add a selfrole to yourself. Server admins must have configured the role as user settable. NOTE: The role is case sensitive!
ca_es: Afegeix un rol a tu mateix. Els administradors del servidor han d'haver configurat la funció com a configurable per l'usuari. NOTA: El rol és sensible a majúscules!
sv_se: Lägg till en självroll till dig själv. Serveradministratörer måste ha konfigurerat rollen som användarinställbar. OBS: Rollen är skiftlägeskänslig!

source: Remove a selfrole from yourself. Server admins must have configured the role as user settable. NOTE: The role is case sensitive!
ca_es: Treu un rol de tu mateix. Els administradors del servidor han d'haver configurat la funció com a configurable per l'usuari. NOTA: El rol és sensible a majúscules!
sv_se: Ta bort en självroll från dig själv. Serveradministratörer måste ha konfigurerat rollen som användarinställbar. OBS: Rollen är skiftlägeskänslig!

source: Lists all available selfroles.
ca_es: Llista tots els selfrols disponibles.
sv_se: Listar alla tillgängliga självroller.

source: Available Selfroles: {selfroles}
ca_es: Selfroles disponibles: {selfroles}
sv_se: Tillgängliga Selfroles: {selfroles}

source: Manage selfroles.
ca_es: Gestiona selfroles.
sv_se: Hantera självroller.

source: Add a role, or a selection of roles, to the list of available selfroles. NOTE: The role is case sensitive!
sv_se: Lägg till en roll eller ett urval av roller till listan över tillgängliga självroller. OBS: Rollen är skiftlägeskänslig!

source: I cannot let you add {role.name} as a selfrole because that role is higher than or equal to your highest role in the Discord hierarchy.
ca_es: No puc deixar-te afegir {role.name} com a selfrole perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte låta dig lägga till {role.name} som en självroll eftersom den rollen är högre än eller lika med din högsta roll i Discord-hierarkin.

source: The role "{role.name}" is already a selfrole.
sv_se: Rollen "{role.name}" är redan en självroll.

source: Added {count} selfroles.
sv_se: Lade till {count} självroller.

source: Added 1 selfrole.
sv_se: Lade till 1 självroll.

source: Remove a role, or a selection of roles, from the list of available selfroles. NOTE: The role is case sensitive!
sv_se: Ta bort en roll eller ett urval av roller från listan över tillgängliga självroller. OBS: Rollen är skiftlägeskänslig!

source: I cannot let you remove {role.name} from being a selfrole because that role is higher than or equal to your highest role in the Discord hierarchy.
ca_es: No puc deixar-te treure {role.name} de ser un selfrole perquè el rol està per sobre o igual que el meu rol més alt a la jerarquia de Discord.
sv_se: Jag kan inte låta dig ta bort {role.name} från att vara en självroll eftersom den rollen är högre än eller lika med din högsta roll i Discord-hierarkin.

source: Removed {count} selfroles.
sv_se: Tog bort {count} självroller.

source: Removed 1 selfrole.
sv_se: Tog bort 1 självroll.

source: Clear the list of available selfroles for this server.
sv_se: Rensa listan över tillgängliga självroller för denna server.

source: There are currently no selfroles.
sv_se: Det finns för närvarande inga självroller.

source: Are you sure you want to clear this server's selfrole list?
sv_se: Är du säker på att du vill rensa serverns självrollista?

source: You took too long to respond.
sv_se: Du tog för lång tid att svara.

source: I cannot clear the selfroles because the selfrole '{role.name}' is higher than or equal to your highest role in the Discord hierarchy.
sv_se: Jag kan inte rensa självrollerna eftersom självrollen'{role.name}' är högre än eller lika med din högsta roll i Discord-hierarkin.

source: Selfrole list cleared.
sv_se: Självrollistan rensad.

source: No changes have been made.
sv_se: Inga ändringar har gjorts.

source: Lock a bot to its current servers only.
ca_es: Bloqueja el bot només als seus servidors actuals.
sv_se: Lås en bot till sina nuvarande servrar.

source: The bot is no longer serverlocked.
ca_es: El bot ja no està bloquejat pel servidor.
sv_se: Botten är inte längre serverlåst.

source: The bot is now serverlocked.
ca_es: El bot està ara bloquejat pel servidor.
sv_se: Botten är nu serverlåst.

source: I could not announce to the following server:
ca_es: No he pogut anunciar al servidor següent:
sv_se: Jag kunde inte meddela till följande server:

source: I could not announce to the following servers:
ca_es: No he pogut anunciar als servidor següents:
sv_se: Jag kunde inte meddela till följande servrar:

source: The Admin cog is not loaded.
ca_es: El cog Admin no s'ha carregat.
sv_se: Admin cog är inte laddad.

source: The role "{role_name}" is not a valid selfrole.
sv_se: Rollen "{role_name}" är inte en giltig självroll.
