Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: downloader/locales/*.po
Languages: ru_ru

source: None - this cog wasn't installed via downloader
ru_ru: Нет - этот cog не был установлен с помощью загрузчика

source: This command is not provided by a cog.
ru_ru: Эта команда не предоставлена cog'ом.

source: Command:
ru_ru: Команда:

source: Cog name:
ru_ru: Название Шестерни:

source: Made by:
ru_ru: Сделано:

source: Repo name:
ru_ru: Название репозитория:

source: Repo URL:
ru_ru: URL репозитория:

source: Repo branch:
ru_ru: Ветка репозитория:

source: Command: {command} Cog name: {cog} Made by: {author} Repo name: {repo_name} Repo URL: {repo_url}
ru_ru: Команда: {command} Шестерня: {cog} Автор: {author} Репозиторий: {repo_name} Ссылка на репозиторий: {repo_url}

source: Repo branch: {branch_name}
ru_ru: Ветвь репозитория: {branch_name}

source: Failed to update the following repositories:
ru_ru: Не удалось обновить следующие репозитории:

source: Failed to update the following repository:
ru_ru: Не удалось обновить следующий репозиторий:

source: The repository's branch might have been removed or the repository is no longer accessible at set url. See logs for more information.
ru_ru: Возможно, ветка репозитория была удалена или репозиторий больше недоступен по заданному url. Для получения дополнительной информации смотрите логи.

source: Repo by the name "{repo_name}" does not exist.
ru_ru: Репозиторий с названием "{repo_name}" не существует.
