Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: downloader/locales/*.po
Languages: ru_ru

source: You're about to add a 3rd party repository. The creator of Red and its community have no responsibility for any potential damage that the content of 3rd party repositories might cause. By typing '{confirmation_message}' you declare that you have read and fully understand the above message. This message won't be shown again until the next reboot. You have **30** seconds to reply to this message.
ru_ru: Вы собираетесь добавить репозиторий третьей стороны. Автор Red и его сообщество не несут ответственности за любой потенциальный ущерб, который может нанести содержимое сторонних репозиториев. Отправив '{confirmation_message}', вы заявляете, что прочитали и полностью поняли приведенное выше сообщение. Это сообщение не будет показано снова до следующей перезагрузки. У вас есть **30** секунд, чтобы ответить на это сообщение.

source: Your response has timed out, please try again.
ru_ru: Время ответа превышено, пожалуйста, попробуйте еще раз.

source: No Downloader cog found.
ru_ru: Модуль Downloader не найден.

source: Cog `{cog_name}` is not installed.
ru_ru: Шестерня `{cog_name}` не установлена.

source: **WARNING:** The following repos are using shared libraries which are marked for removal in the future: {repo_list}. You should inform maintainers of these repos about this message.
ru_ru: **ВНИМАНИЕ:** Следующие репозитории используют общие библиотеки, которые помечены для удаления: {repo_list}. Пожалуйста, сообщите разработчикам об этом.

source: Install community cogs made by Cog Creators. Community cogs, also called third party cogs, are not included in the default Red install. Community cogs come in repositories. Repos are a group of cogs you can install. You always need to add the creator's repository using the `[p]repo` command before you can install one or more cogs from the creator.
ru_ru: Установите Шестерни сообщества. Шестерни сообщества, также называемые как Шестерни сторонних разработчиков, не включены в стандартную поставку Red. Шестерни сообщества поставляются в репозиториях. Репозитории - это пакет Шестерней, которые вы можете установить. Вам нужно добавить репозиторий от одного из создателей с помощью команды `[p]repo`, прежде чем вы сможете установить одну или несколько сторонних Шестерней.

source: Install a group of dependencies using pip. Examples: - `[p]pipinstall bs4` - `[p]pipinstall py-cpuinfo psutil` Improper usage of this command can break your bot, be careful. **Arguments** - `<deps...>` The package or packages you wish to install.
ru_ru: Установите группу зависимостей с помощью pip. Например: - `[p]pipinstall bs4` - `[p]pipinstall py-cpuinfo psutil`. Неаккуратное использование этой команды может сломать вашего бота, будьте внимательны. **Аргументы** - `<deps...>` Пакет или пакеты, которые вы хотите установить.

source: Libraries installed.
ru_ru: Библиотеки установлены.

source: Library installed.
ru_ru: Зависимость(и) установлена(ы).

source: Some libraries failed to install. Please check your logs for a complete list.
ru_ru: Не удалось установить некоторые библиотеки. Пожалуйста, проверьте ваши логи для получения полного списка.

source: The library failed to install. Please check your logs for a complete list.
ru_ru: Не удалось установить библиотеку. Пожалуйста, проверьте логи для получения полной информации.

source: Base command for repository management.
ru_ru: Базовая команда для управления репозиториями.

source: Add a new repo. Examples: - `[p]repo add 26-Cogs https://github.com/Twentysix26/x26-Cogs` - `[p]repo add Laggrons-Dumb-Cogs https://github.com/retke/Laggrons-Dumb-Cogs v3` Repo names can only contain characters A-z, numbers, underscores, and hyphens. The branch will be the default branch if not specified. **Arguments** - `<name>` The name given to the repo. - `<repo_url>` URL to the cog branch. Usually GitHub or GitLab. - `[branch]` Optional branch to install cogs from.
ru_ru: Установить новый репозиторий. Примеры: - `[p]repo add 26-Cogs https://github.com/Twentysix26/x26-Cogs` - `[p]repo add Laggrons-Dumb-Cogs https://github.com/retke/Laggrons-Dumb-Cogs v3`. Название репозитория может содержать только латиницу, цифры, подчеркивания и дефисы. Если не указать ветку для репозитория, то выбор падет на ветку по умолчанию. **Аргументы** - `<name>` Название репозитория. - `<repo_url>` Ссылка на репозиторий. Обычно это GitHub или GitLab. - `[branch]` (опционально) Ветка репозитория.

source: Repo names cannot start or end with a dot.
ru_ru: Название репозитория не может начинаться с точки.

source: Repo names can only contain characters A-z, numbers, underscores, hyphens, and dots.
ru_ru: Название репозитория может содержать только латиницу, цифры, подчеркивания и дефисы.

source: The repo name you provided is already in use. Please choose another name.
ru_ru: Название репозитория, которое вы указали, уже занято. Пожалуйста, выберите другое название.

source: Something went wrong during the cloning process. See logs for more information.
ru_ru: Что-то пошло не так во время процесса клонирования репозитория. Для получения подробной информации см. логи.

source: Something went wrong trying to add that repo. See logs for more information.
ru_ru: Что-то пошло не так при попытке добавить этот репозиторий. Для получения подробной информации см. логи.

source: Repo `{name}` successfully added.
ru_ru: Репозиторий `{name}` успешно добавлен.

source: Remove repos and their files. Examples: - `[p]repo delete 26-Cogs` - `[p]repo delete 26-Cogs Laggrons-Dumb-Cogs` **Arguments** - `<repos...>` The repo or repos to remove.
ru_ru: Удалить репозитории и их следы. Примеры: - `[p]repo delete 26-Cogs` - `[p]repo delete 26-Cogs Laggrons-Dumb-Cogs` **Аргументы** - `<repos...>` Название(я) репозитория(ев) для удаления.

source: Successfully deleted repos:
ru_ru: Успешно удалены репозитории:

source: Successfully deleted the repo:
ru_ru: Успешно удалён репозиторий:

source: List all installed repos.
ru_ru: Список всех установленных репозиториев.

source: There are no repos installed.
ru_ru: Не установлен ни один репозиторий.

source: Installed Repos:
ru_ru: Установлены репозитории:

source: Installed Repo:
ru_ru: Установлен репозиторий:

source: Show information about a repo. Example: - `[p]repo info 26-Cogs` **Arguments** - `<repo>` The name of the repo to show info about.
ru_ru: Информация о репозитории. Например: - `[p]repo info 26-Cogs` **Аргументы** - `<repo>` Название репозитория.

source: Missing from info.json
ru_ru: Отсутствует в info.json

source: Repo url: {repo_url}
ru_ru: Ссылка на репозиторий: {repo_url}

source: Branch: {branch_name}
ru_ru: Ветка: {branch_name}

source: Made by: {author} Description: {description}
ru_ru: Автор: {author} Описание: {description}

source: Information on {repo_name} repo:{information}
ru_ru: Информация о репозитории {repo_name}:{information}

source: Update all repos, or ones of your choosing. This will *not* update the cogs installed from those repos. Examples: - `[p]repo update` - `[p]repo update 26-Cogs` - `[p]repo update 26-Cogs Laggrons-Dumb-Cogs` **Arguments** - `[repos...]` The name or names of repos to update. If omitted, all repos are updated.
ru_ru: Обновите все, или выбранные вами репозитории. Это **не** обновит Шестерни, установленные из репозиториев. Например: - `[p]update` - `[p]repo update 26-Cogs` - `[p]repo update 26-Cogs Laggrons-Dumb-Cogs` **Аргументы** - `[repos...]` (опционально) Название(я) репозитория(ев) для обновления. Если не указано, то все репозитории обновятся.

source: Repo update completed successfully.
ru_ru: Обновление репозиториев прошло успешно.

source: Updated:
ru_ru: Обновлено:

source: All installed repos are already up to date.
ru_ru: Все установленные репозитории уже обновлены.

source: These repos are already up to date.
ru_ru: Эти репозитории уже обновлены.

source: This repo is already up to date.
ru_ru: Этот репозиторий уже обновлен.

source: Base command for cog installation management commands.
ru_ru: Базовая команда для команд управления установкой cog.

source: This command should not be used unless Red specifically asks for it. This command will reinstall cog requirements and shared libraries for all installed cogs. Red might ask the owner to use this when it clears contents of the lib folder because of change in minor version of Python.
ru_ru: Эту команду не следует использовать, если Red специально не попросит об этом. Эта команда переустановит требования cog и общие библиотеки для всех установленных cog. Red может попросить владельца использовать эту команду, когда он очищает содержимое папки lib из-за изменения младшей версии Python.

source: Failed to install requirements:
ru_ru: Не удалось установить требования:

source: Failed to install the requirement:
ru_ru: Не удалось установить требование:

source: Failed to install shared libraries:
ru_ru: Не удалось установить общие библиотеки:

source: Failed to install shared library:
ru_ru: Не удалось установить общую библиотеку:

source: Cog requirements and shared libraries for all installed cogs have been reinstalled but there were some errors:
ru_ru: Требования cog и общих библиотек для всех установленных cog'ов были переустановлены, но возникли некоторые ошибки:

source: Cog requirements and shared libraries for all installed cogs have been reinstalled.
ru_ru: Требования для cog'ов и общих библиотек для всех установленных cog'ов были переустановлены.

source: Install a cog from the given repo. Examples: - `[p]cog install 26-Cogs defender` - `[p]cog install Laggrons-Dumb-Cogs say roleinvite` **Arguments** - `<repo>` The name of the repo to install cogs from. - `<cogs...>` The cog or cogs to install.
ru_ru: Установите cog из указанного репозитория. Примеры: - `[p]cog install 26-Cogs defender` - `[p]cog install Laggrons-Dumb-Cogs say roleinvite` **Аргументы** - `<repo>` Название репозитория, из которого нужно установить cog. - `<cogs...>` Cog или cog'и для установки.

source: Install a cog from the specified revision of given repo. Revisions are "commit ids" that point to the point in the code when a specific change was made. The latest revision can be found in the URL bar for any GitHub repo by [pressing "y" on that repo](https://docs.github.com/en/free-pro-team@latest/github/managing-files-in-a-repository/getting-permanent-links-to-files#press-y-to-permalink-to-a-file-in-a-specific-commit). Older revisions can be found in the URL bar by [viewing the commit history of any repo](https://cdn.discordapp.com/attachments/133251234164375552/775760247787749406/unknown.png) Example: - `[p]cog installversion Broken-Repo e798cc268e199612b1316a3d1f193da0770c7016 cog_name` **Arguments** - `<repo>` The name of the repo to install cogs from. - `<revision>` The revision to install from. - `<cogs...>` The cog or cogs to install.
ru_ru: Установка cog'а из указанной ревизии данного репозитория. Ревизии - это "идентификаторы commit'ов", которые указывают на точку в коде, когда было сделано конкретное изменение. Последнюю ревизию можно найти в строке URL для любого репозитория GitHub, если [нажать "y" на этом репозитории](https://docs.github.com/en/free-pro-team@latest/github/managing-files-in-a-repository/getting-permanent-links-to-files#press-y-to-permalink-to-a-file-in-a-specific-commit). Более старые ревизии можно найти в строке URL, если [просмотреть историю comit'ов любого репозитория](https://cdn.discordapp.com/attachments/133251234164375552/775760247787749406/unknown.png). Пример: - `[p]cog installversion Broken-Repo e798cc268e199612b1316a3d1f193da0770c7016 cog_name`. **Аргументы** - `<repo>` Название репозитория для установки cog'ов. - `<revision>` Ревизия, из которой нужно установить. - `<cogs...>` Cog или cog'и для установки.

source: Error: short sha1 `{rev}` is ambiguous. Possible candidates:
ru_ru: Ошибка: короткий sha1 `{rev}` неоднозначен. Возможные кандидаты:

source: Error: there is no revision `{rev}` in repo `{repo.name}`
ru_ru: Ошибка: нет ревизии `{rev}` в репозитории `{repo.name}`

source: Failed to install requirements:
ru_ru: Не удалось установить требования:

source: Failed to install the requirement:
ru_ru: Не удалось установить требование:

source: Failed to install shared libraries for `{repo.name}` repo:
ru_ru: Не удалось установить общие библиотеки для репозитория `{repo.name}`:

source: Failed to install shared library for `{repo.name}` repo:
ru_ru: Не удалось установить общую библиотеку для репозитория `{repo.name}`:

source: Failed to install cogs:
ru_ru: Не удалось установить cog'и:

source: Failed to install the cog:
ru_ru: Не удалось установить cog:

source: Successfully installed cogs:
ru_ru: Успешно установлены cog'и:

source: Successfully installed the cog:
ru_ru: Успешно установлен cog:

source: These cogs are now pinned and won't get updated automatically. To change this, use `{prefix}cog unpin <cog>`
ru_ru: Эти cog'и теперь закреплены и больше не будут обновляться автоматически. Чтобы изменить это, используйте `{prefix}cog unpin <cog>`

source: You can load them using {command_1}. To see end user data statements, you can use {command_2}.
ru_ru: Вы можете загрузить их с помощью {command_1}. Чтобы увидеть операторы данных конечного пользователя, вы можете использовать {command_2}.

source: Uninstall cogs. You may only uninstall cogs which were previously installed by Downloader. Examples: - `[p]cog uninstall defender` - `[p]cog uninstall say roleinvite` **Arguments** - `<cogs...>` The cog or cogs to uninstall.
ru_ru: Деинсталлировать зубчатые колеса. Вы можете удалить только те коги, которые были ранее установлены программой Downloader. Примеры: - `[p]cog uninstall defender` - `[p]cog uninstall say roleinvite`. **Аргументы** - `<cogs...>` Ког или коги для деинсталляции.

source: Successfully uninstalled cogs:
ru_ru: Успешно удалены cog'и:

source: Successfully uninstalled the cog:
ru_ru: Успешно удален cog:

source: Downloader has removed these cogs from the installed cogs list but it wasn't able to find their files:
ru_ru: Загрузчик удалил этот cog из списка установленных cog'ов, но не смог найти их файлы:

source: They were most likely removed without using {command_1}. You may need to remove those files manually if the cogs are still usable. If so, ensure the cogs have been unloaded with {command_2}.
ru_ru: Скорее всего, они были удалены без использования {command_1}. Вам может понадобиться удалить эти файлы вручную, если cog'и все еще можно использовать. Если это так, убедитесь, что cog'и были выгружены с помощью {command_2}.

source: Downloader has removed this cog from the installed cogs list but it wasn't able to find its files:
ru_ru: Загрузчик удалил этот cog из списка установленных cog'ов, но не смог найти его файлы:

source: It was most likely removed without using {command_1}. You may need to remove those files manually if the cog is still usable. If so, ensure the cog has been unloaded with {command_2}.
ru_ru: Скорее всего, он был удален без использования {command_1}. Вам может понадобиться удалить эти файлы вручную, если cog все еще можно использовать. Если это так, убедитесь, что cog был выгружен с помощью {command_2}.

source: Pin cogs - this will lock cogs on their current version. Examples: - `[p]cog pin defender` - `[p]cog pin outdated_cog1 outdated_cog2` **Arguments** - `<cogs...>` The cog or cogs to pin. Must already be installed.
ru_ru: Pin cogs - это закрепит cog'и в их текущей версии. Примеры: - `[p]cog pin defender` - `[p]cog pin outdated_cog1 outdated_cog2` **Аргументы** - `<cogs...>` Cog или cog'и для закрепления. Они должны быть уже установлены.

source: Pinned cogs:
ru_ru: Закреплённые cog'и:

source: Pinned cog:
ru_ru: Закрепленный cog:

source: These cogs were already pinned:
ru_ru: Эти cog'и уже были закреплены:

source: This cog was already pinned:
ru_ru: Этот cog уже был закреплен:

source: Unpin cogs - this will remove the update lock from those cogs. Examples: - `[p]cog unpin defender` - `[p]cog unpin updated_cog1 updated_cog2` **Arguments** - `<cogs...>` The cog or cogs to unpin. Must already be installed and pinned.
ru_ru: Открепить cog'и - это снимет блокировку обновления с этих cog'ов. Примеры: - `[p]cog unpin defender` - `[p]cog unpin updated_cog1 updated_cog2` **Аргументы** - `<cogs...>` Cog или cog'и для открепления. Должны быть уже установлены и закреплены.

source: Unpinned cogs:
ru_ru: Незакрепленные cog'и:

source: Unpinned cog:
ru_ru: Cog откреплен:

source: These cogs weren't pinned:
ru_ru: Эти cog'и не были закреплены:

source: This cog was already not pinned:
ru_ru: Этот cog уже был откреплен:

source: List currently pinned cogs.
ru_ru: Список текущих прикрепленных cog'ов.

source: None.
ru_ru: Нет.

source: (continued)
ru_ru: (продолжение)

source: Pinned Cogs:
ru_ru: Закреплено Cog'ов:

source: Pinned Cogs:
ru_ru: Закрепленные Cog'и:

source: Check for available cog updates (including pinned cogs). This command doesn't update cogs, it only checks for updates. Use `[p]cog update` to update cogs.
ru_ru: Проверка доступных обновлений cog (включая закрепленные cog). Эта команда не обновляет cog'и, она только проверяет наличие обновлений. Для обновления cog'ов используйте команду `[p]cog update`.

source: These cogs can be updated:
ru_ru: Данные cog'и можно обновить:

source: This cog can be updated:
ru_ru: Этот cog может быть обновлен:

source: These shared libraries can be updated:
ru_ru: Эти общие библиотеки могут быть обновлены:

source: This shared library can be updated:
ru_ru: Эта общая библиотека может быть обновлена:

source: No cogs can be updated.
ru_ru: Ни один cog не может быть обновлен.

source: All installed cogs are up to date.
ru_ru: Все установленные cog'и обновлены.

source: There were no cogs to check.
ru_ru: Не было никаких cog'ов, которые можно было бы проверить.

source: These cogs are pinned and therefore weren't checked:
ru_ru: Эти cog'и закреплены и поэтому не проверялись:

source: This cog is pinned and therefore wasn't checked:
ru_ru: Этот cog закреплен и поэтому не проверялся:

source: Cogs from provided repos are already up to date.
ru_ru: Cog'и из предоставленных репозиториев уже обновлены.

source: Provided cogs are already up to date with this revision.
ru_ru: Предоставленные cog'и уже обновлены этой ревизией.

source: Cogs from provided repo are already up to date with this revision.
ru_ru: Cog'и из предоставленного репозитория уже обновлены до этой ревизии.

source: Provided cogs are already up to date.
ru_ru: Предоставленные cog'и уже обновлены.

source: All installed cogs are already up to date.
ru_ru: Все установленные модули уже обновлены.

source: List all available cogs from a single repo. Example: - `[p]cog list 26-Cogs` **Arguments** - `<repo>` The repo to list cogs from.
ru_ru: Вывести список всех доступных cog'ов из одного репозитория. Пример: - `[p]cog list 26-Cogs`. **Аргументы** - `<repo>` Репозиторий, из которого нужно перечислить cog'и.

source: Installed Cogs: {text}
ru_ru: Установленные cog'и: {text}

source: Installed Cog: {text}
ru_ru: Установлен cog: {text}

source: Available Cogs: No cogs are available.
ru_ru: Доступные cog'и: Отсутствуют cog'и.

source: Available Cogs: {text}
ru_ru: Доступные cog'и: {text}

source: Available Cog: {text}
ru_ru: Доступный cog: {text}

source: List information about a single cog. Example: - `[p]cog info 26-Cogs defender` **Arguments** - `<repo>` The repo to get cog info from. - `<cog>` The cog to get info on.
ru_ru: Перечислить информацию об одном cog'е. Пример: - `[p]cog info 26-Cogs defender`. **Аргументы** - `<repo>` Репозиторий, из которого нужно получить информацию о cog'е. - `<cog>` Cog, о котором нужно получить информацию.

source: There is no cog `{cog_name}` in the repo `{repo.name}`
ru_ru: В репозитории `{repo.name}` нет модуля `{cog_name}`

source: Information on {cog_name}: {description} End user data statement: {end_user_data_statement} Made by: {author} Requirements: {requirements}
ru_ru: Информация о {cog_name}: {description}. Заявление о данных конечного пользователя: {end_user_data_statement} Сделано: {author} Требования: {requirements}

source: Author of the cog didn't provide end user data statement.
ru_ru: Автор cog'а не предоставил данные о конечном пользователе.

source: Couldn't find these cogs in {repo.name}:
ru_ru: Не удалось найти эти cog'и в {repo.name}:

source: Couldn't find this cog in {repo.name}:
ru_ru: Не удалось найти этот cog в {repo.name}:

source: These cogs were already installed:
ru_ru: Эти cog'и уже были установлены:

source: This cog was already installed:
ru_ru: Этот cog уже установлен:

source: Some cogs with these names are already installed from different repos:
ru_ru: Некоторые cog'и с такими именами уже установлены из разных репозиториев:

source: Cog with this name is already installed from a different repo:
ru_ru: Шестерня с таким названием уже установлена из другого репозитория:

source: (Minimum: {min_version})
ru_ru: (Минимум: {min_version})

source: (Minimum: {min_version}
ru_ru: (Минимум: {min_version}

source: , at most: {max_version}
ru_ru: , максимум: {max_version}

source: These cogs require higher python version than you have:
ru_ru: Эти cog'и требуют более новой версии Python, чем у вас есть:

source: This cog requires higher python version than you have:
ru_ru: Для этого cog'а требуется более новая версия Python, чем у вас:

source: These cogs require different Red version than you currently have ({current_version}):
ru_ru: Для этих cog'ов требуется версия Red, отличная от текущей ({current_version}):

source: This cog requires different Red version than you currently have ({current_version}):
ru_ru: Этот cog требует версию Red, отличную от текущей ({current_version}):

source: Cog update completed successfully.
ru_ru: Обновление модуля завершено успешно.

source: End user data statements of these cogs have changed:
ru_ru: Данные конечных пользователей этих cog'ов изменились:

source: You can use {command} to see the updated statements.
ru_ru: Вы можете использовать {command} для просмотра обновленных утверждений.

source: End user data statement of this cog has changed:
ru_ru: Показания конечного пользователя этого cog'а изменились:

source: You can use {command} to see the updated statement.
ru_ru: Вы можете использовать {command}, чтобы увидеть обновленный отчет.

source: Failed to update cogs:
ru_ru: Не удалось обновить cog'и:

source: Failed to update cog:
ru_ru: Не удалось обновить cog:

source: No cogs were updated.
ru_ru: Ни один cog не был обновлен.

source: Some shared libraries were updated, you should restart the bot to bring the changes into effect.
ru_ru: Некоторые общие библиотеки были обновлены, вам следует перезапустить бота, чтобы изменения вступили в силу.

source: A shared library was updated, you should restart the bot to bring the changes into effect.
ru_ru: Общая библиотека была обновлена, вам следует перезапустить бота, чтобы изменения вступили в силу.

source: None of the updated cogs were previously loaded. Update complete.
ru_ru: Ни один из обновленных модулей не был загружен ранее. Обновление завершено.

source: Would you like to reload the updated cogs?
ru_ru: Вы хотите перезагрузить обновленные модули?

source: Would you like to reload the updated cog?
ru_ru: Не хотите ли вы перезагрузить обновленный cog?

source: OK then.
ru_ru: Хорошо, тогда.

source: Find which cog a command comes from. This will only work with loaded cogs. Example: - `[p]findcog ping` **Arguments** - `<command_name>` The command to search for.
ru_ru: Определите, от какого cog'а выбранная команда. Это работает только с загруженными cog'ами. Пример: - `[p]findcog ping`. **Аргументы** - `<command_name>` Команда для поиска.

source: That command doesn't seem to exist.
ru_ru: Эта команда, кажется, не существует.

source: Missing from installed repos
ru_ru: Отсутствует из установленных репозиториев

source: Unknown
ru_ru: Неизвестный
