Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: filter/locales/*.po
Languages: ru_ru

source: This cog is designed for "filtering" unwanted words and phrases from a server. It provides tools to manage a list of words or sentences, and to customize automatic actions to be taken against users who use those words in channels or in their name/nickname. This can be used to prevent inappropriate language, off-topic discussions, invite links, and more.
ru_ru: Данный cog предназначен для "фильтрации" нежелательных слов и фраз с сервера. Он предоставляет инструменты для управления списком слов или предложений, а также для настройки автоматических действий, которые будут предприняты против пользователей, использующих эти слова в каналах или в своем имени/прозвище. Это можно использовать для предотвращения неуместных слов, обсуждений не по теме, пригласительных ссылок и многого другого.

source: Base command to manage filter settings.
ru_ru: Базовая команда для управления настройками фильтра.

source: Set the nickname for users with a filtered name. Note that this has no effect if filtering names is disabled (to toggle, run `[p]filter names`). The default name used is *John Doe*. Example: - `[p]filterset defaultname Missingno` **Arguments:** - `<name>` The new nickname to assign.
ru_ru: Установка псевдонима для пользователей с отфильтрованным именем. Обратите внимание, что это не имеет эффекта, если фильтрация имен отключена (для включения используйте команду `[p]filter names`). По умолчанию используется имя *John Doe*. Пример: - `[p]filterset defaultname Missingno` **Аргументы:** - `<name>` Новый псевдоним для присвоения.

source: The name to use on filtered names has been set.
ru_ru: Имя для использования в отфильтрованных именах было установлено.

source: Set the filter's autoban conditions. Users will be banned if they send `<count>` filtered words in `<timeframe>` seconds. Set both to zero to disable autoban. Examples: - `[p]filterset ban 5 5` - Ban users who say 5 filtered words in 5 seconds. - `[p]filterset ban 2 20` - Ban users who say 2 filtered words in 20 seconds. **Arguments:** - `<count>` The amount of filtered words required to trigger a ban. - `<timeframe>` The period of time in which too many filtered words will trigger a ban.
ru_ru: Установите условия автобана фильтра. Пользователи будут заблокированы, если они отправят `<count>` отфильтрованных слов в течение `<timeframe>` секунд. Установите оба значения в ноль, чтобы отключить автобан. Примеры: - `[p]filterset ban 5 5` - Заблокировать пользователей, которые произносят 5 отфильтрованных слов за 5 секунд. - `[p]filterset ban 2 20` - Заблокировать пользователей, которые произносят 2 отфильтрованных слова за 20 секунд. **Аргументы:** - `<count>` Количество отфильтрованных слов, необходимое для запуска бана. - `<timeframe>` Период времени, в течение которого слишком большое количество отфильтрованных слов вызовет блокировку.

source: Count and timeframe either both need to be 0 or both need to be greater than 0!
ru_ru: Количество или период должны быть равны 0, либо оба должна быть больше 0!

source: Autoban disabled.
ru_ru: Автобан отключен.

source: Count and time have been set.
ru_ru: Количество и период были сохранены.

source: Base command to add or remove words from the server filter. Use double quotes to add or remove sentences.
ru_ru: Базовая команда для добавления или удаления слов из фильтра сервера. Используйте двойные кавычки для добавления или удаления предложений.

source: Clears this server's filter list.
ru_ru: Очищает список фильтров этого сервера.

source: The filter list for this server is empty.
ru_ru: Список фильтров для этого сервера пуст.

source: Are you sure you want to clear this server's filter list?
ru_ru: Вы уверены, что хотите очистить список фильтров этого сервера?

source: You took too long to respond.
ru_ru: Вы слишком долго не отвечали.

source: Server filter cleared.
ru_ru: Фильтр сервера очищен.

source: No changes have been made.
ru_ru: Никаких изменений не произошло.

source: Send a list of this server's filtered words.
ru_ru: Отправить список отфильтрованных слов этого сервера.

source: There are no current words setup to be filtered in this server.
ru_ru: На этом сервере нет текущих слов, настроенных на фильтрацию.

source: Filtered in this server:
ru_ru: Отфильтровано на этом сервере:

source: I can't send direct messages to you.
ru_ru: Я не могу отправить вам личное сообщение.

source: Base command to add or remove words from the channel filter. Use double quotes to add or remove sentences.
ru_ru: Базовая команда для добавления или удаления слов из фильтра канала. Используйте двойные кавычки для добавления или удаления предложений.

source: Clears this channel's filter list.
ru_ru: Очищает список фильтров этого канала.

source: The filter list for this channel is empty.
ru_ru: Список фильтров для этого канала пуст.

source: Are you sure you want to clear this channel's filter list?
ru_ru: Вы уверены, что хотите очистить список фильтров этого канала?

source: Channel filter cleared.
ru_ru: Фильтр канала очищен.

source: Send a list of the channel's filtered words.
ru_ru: Отправить список отфильтрованных слов канала.

source: There are no current words setup to be filtered in this channel.
ru_ru: В этом канале нет текущих слов, настроенных на фильтрацию.

source: Filtered in this channel:
ru_ru: Отфильтровано в этом канале:

source: Add words to the filter. Use double quotes to add sentences. Examples: - `[p]filter channel add word1 word2 word3` - `[p]filter channel add "This is a sentence"` **Arguments:** - `[words...]` The words or sentences to filter.
ru_ru: Добавление слов в фильтр. Для добавления предложений используйте двойные кавычки. Примеры: - `[p]filter channel add word1 word2 word3`. - `[p]filter channel add "This is a sentence"`. **Аргументы:** - `[words...]` Слова или предложения для фильтрации.

source: Words added to filter.
ru_ru: Слова добавлены в фильтр.

source: Words already in the filter.
ru_ru: Слова уже в фильтре.

source: Remove words from the filter. Use double quotes to remove sentences. Examples: - `[p]filter channel remove word1 word2 word3` - `[p]filter channel remove "This is a sentence"` **Arguments:** - `[words...]` The words or sentences to no longer filter.
ru_ru: Удаление слов из фильтра. Для удаления предложений используйте двойные кавычки. Примеры: - `[p]filter channel remove word1 word2 word3`. - `[p]filter channel remove "This is a sentence"`. **Аргументы:** - `[words...]` Слова или предложения, которые больше не будут фильтроваться.

source: Words removed from filter.
ru_ru: Слова удалены из фильтра.

source: Those words weren't in the filter.
ru_ru: Эти слова не были в фильтре.

source: Add words to the filter. Use double quotes to add sentences. Examples: - `[p]filter add word1 word2 word3` - `[p]filter add "This is a sentence"` **Arguments:** - `[words...]` The words or sentences to filter.
ru_ru: Добавьте предложения в фильтр. Для добавления предложений используйте двойные кавычки. Примеры: - `[p]filter add word1 word2 word3`. - `[p]filter add "This is a sentence"`. **Аргументы:** - `[words...]` Слова или предложения для фильтрации.

source: Words successfully added to filter.
ru_ru: Слова успешно добавлены в фильтр.

source: Those words were already in the filter.
ru_ru: Эти слова уже были в фильтре.

source: Remove words from the filter. Use double quotes to remove sentences. Examples: - `[p]filter remove word1 word2 word3` - `[p]filter remove "This is a sentence"` **Arguments:** - `[words...]` The words or sentences to no longer filter.
ru_ru: Удалите предложения из фильтра. Для удаления предложений используйте двойные кавычки. Примеры: - `[p]filter remove word1 word2 word3`. - `[p]filter remove "Это предложение"`. **Аргументы:** - `[words...]` Слова или предложения, которые больше не нужно фильтровать.

source: Words successfully removed from filter.
ru_ru: Слова успешно удалены из фильтра.

source: Toggle name and nickname filtering. This is disabled by default.
ru_ru: Включить фильтрацию имен и псевдонимов. По умолчанию эта функция отключена.

source: Names and nicknames will no longer be filtered.
ru_ru: Имена и никнеймы больше не будут фильтроваться.

source: Names and nicknames will now be filtered.
ru_ru: Имена и никнеймы теперь будут отфильтрованы.

source: Filtered words used: {words}
ru_ru: Использованные отфильтрованные слова: {words}

source: Filtered word used: {word}
ru_ru: Использованное фильтрованное слово: {word}

source: Autoban (too many filtered messages.)
ru_ru: Автобан (слишком много отфильтрованных сообщений.)

source: Filtered nickname
ru_ru: Отфильтрованный никнейм

source: Filtered name
ru_ru: Отфильтрованное имя
