Repository: Shadowbob-corp/Shadow-Bot-Cogs
Catalog: audio/apis/locales/*.po
Languages: es_es, fr_fr, hr_hr, ru_ru

source: Failing to get tracks, skipping remaining.
es_es: Error al obtener las canciones, saltando las que estaban pendientes.
fr_fr: Impossible d'obtenir les pistes, pistes ignorées.
hr_hr: Dobivanje glazbe nije uspjelo, preskačem preostale.
ru_ru: Не удалось получить треки, пропускаю оставшиеся треки.

source: The Spotify API key or client secret has not been set properly. Use `{prefix}audioset spotifyapi` for instructions.
es_es: La clave API de Spotify o el llave secreta de cliente no se ha configurado correctamente. Escribe `{prefix}audioset spotifyapi` para obtener instrucciones.
fr_fr: La clé de l'API de Spotify ou le secret n'ont pas étés correctement définis. Utilisez `{prefix}audioset spotifyapi` pour connaître la marche à suivre.
hr_hr: Spotify API ključ nije pravilno postavljen. Koristi `{prefix}audioset spotifyapi` za upute.
ru_ru: API ключ Spotify или секрет клиента были установлены неправильно. Для получения инструкций используйте `{prefix}audioset spotifyapi`.

source: This doesn't seem to be a valid Spotify playlist/album URL or code.
es_es: Esta no parece ser una URL o código válido de una playlist/álbum de Spotify.
fr_fr: Cela ne semble pas être une URL ou un album/playlist Spotify valide.
hr_hr: Čini se da ovo nije važeći URL ili kȏd Spotify albuma/popisa za reprodukciju.
ru_ru: Это не похоже на действительный URL адрес или код плейлиста/альбома Spotify.

source: This doesn't seem to be a supported Spotify URL or code.
es_es: Esto no parece ser una URL o código compatible con Spotify.
fr_fr: Cela ne semble pas être une URL ou un code Spotify pris en charge.
hr_hr: Čini se da ovo nije podržani Spotify URL ili kȏd.
ru_ru: Это не похоже на поддерживаемую Spotify ссылку или код.

source: The connection was reset while loading the playlist.
es_es: La conexión se reinició mientras se cargaba la lista de reproducción.
fr_fr: La connexion a été réinitialisée lors du chargement de la playlist.
hr_hr: Veza je prekinuta prilikom učitavanja popisa za reprodukciju.
ru_ru: Соединение было прервано при загрузке плейлиста.

source: Player timeout, skipping remaining tracks.
es_es: El reproductor ha acabado su tiempo de espera, omitiendo las canciones restantes.
fr_fr: Arrêt du lecteur, pistes restantes ignorées.
hr_hr: Playeru je isteklo vrijeme, preskačem preostale pjesme.
ru_ru: Тайм-аут проигрывателя, пропуск оставшихся треков.

source: {bad_tracks} tracks cannot be queued.
es_es: {bad_tracks} canciones no pueden ser puestas en la cola.
fr_fr: {bad_tracks} pistes ne peuvent pas être mises en attente.
hr_hr: {bad_tracks} pjesme se ne mogu staviti u red čekanja.
ru_ru: {bad_tracks} невозможно добавить в очередь.

source: Playlist Enqueued
es_es: Lista de reproducción en cola
fr_fr: Playlist en file d’attente
hr_hr: Popis za reprodukciju dodan u red čekanja
ru_ru: Плейлист добавлен в очередь

source: Added {num} tracks to the queue.{maxlength_msg}
es_es: Se añadió {num} canciones a la cola.{maxlength_msg}
fr_fr: Ajout de {num} pistes à la file d'attente.{maxlength_msg}
hr_hr: Dodano {num} pjesama u red čekanja.{maxlength_msg}
ru_ru: Добавлено {num} треков в очередь.{maxlength_msg}

source: {time} until start of playlist playback: starts at #{position} in queue
es_es: {time} hasta el inicio de la reproducción de la lista: comienza en #{position} en cola
fr_fr: {time} avant le début de la lecture de la playlist : commence à la #{position} dans la liste
hr_hr: {time} do reprodukcije popisa za reprodukciju: #{position} u redu čekanja
ru_ru: {time} до начала воспроизведения плейлиста: начинается с #{position} в очереди

source: Nothing found. The YouTube API key may be invalid or you may be rate limited on YouTube's search service. Check the YouTube API key again and follow the instructions at `{prefix}audioset youtubeapi`.
es_es: No se ha encontrado nada. La clave API de YouTube puede ser inválida o puede que estés limitado al servicio de búsqueda de YouTube. Comprueba de nuevo la clave API de YouTube y sigue las instrucciones en `{prefix}audioset youtubeapi`.
fr_fr: Rien n'a été trouvé. La clé de l'API YouTube peut être invalide ou vous pouvez être limité sur le service de recherche de YouTube. Vérifiez à nouveau la clé de l'API YouTube et suivez les instructions de `{prefix}audioset youtubeapi`.
hr_hr: Ništa nije pronađeno. YouTube API ključ može biti nevažeći ili ste možda ograničeni na YouTube-ovoj usluzi pretraživanja. Ponovno provjerite YouTube API ključ i slijedite upute na `{prefix}audioset youtubeapi`.
ru_ru: Ничего не найдено. Ключ YouTube API может быть недействительным или вы можете быть ограничены в запросах в поисковом сервисе YouTube. Проверьте API ключ YouTube еще раз и следуйте инструкциям в `{prefix}audio set you_tube API`.

source: Your YouTube Data API token is invalid. Check the YouTube API key again and follow the instructions at `{prefix}audioset youtubeapi`.
es_es: Su token de la API de datos de YouTube no es válida. Verifique la clave API de YouTube nuevamente y siga las instrucciones en `{prefix}audioset youtubeapi`.
fr_fr: Votre token de l'API YouTube Data n'est pas valide. Vérifiez à nouveau la clé de l'API YouTube et suivez les instructions de `{prefix}audioset youtubeapi`.
hr_hr: Vaš YouTube Data API token nije važeći. Ponovno provjerite YouTube API ključ i slijedite upute na `{prefix}audioset youtubeapi`.
ru_ru: Ваш API токен от YouTube Data недействителен. Проверьте ключ YouTube API снова и следуйте инструкциям в `{prefix}audio set you_tube API`.

source: YouTube API error code: 403 Your YouTube API key may have reached the account's query limit for today. Please check <https://developers.google.com/youtube/v3/getting-started#quota> for more information.
es_es: Código de error de la API de YouTube: 403 Tu clave API de YouTube puede haber alcanzado el límite de consultas de la cuenta para hoy. Consulte <https://developers.google.com/youtube/v3/getting-started#quota> para obtener más información.
fr_fr: Code d'erreur de l'API YouTube : 403 Votre clé d'API YouTube peut avoir atteint la limite de requêtes quotidienne. Veuillez consulter <https://developers.google.com/youtube/v3/getting-started#quota> pour plus d'informations.
hr_hr: Kôd pogreške YouTube API-a: 403 Vaš YouTube API ključ je možda dosegao ograničenje upita za danas. Za više informacija provjerite <https://developers.google.com/youtube/v3/getting-started#quota>.
ru_ru: Код ошибки YouTube API: 403 Ваш ключ YouTube API достиг лимита запросов на сегодня. Пожалуйста, перейдите по ссылке <https://developers.google.com/youtube/v3/getting-started#quota> для получения дополнительной информации.
